1. /일반문자열/
2. /^일반문자열/, /일반문자열$/ : 처음과 끝
3. /h.llo world/ : 모든 문자(dot, '.')
4. h[eay]llo world : 택1
5. /[a-zA-Z0-9]/ : 범위
6. /[^a-zA-Z0-9]/ : 부정(not)
7. /.(a|e|o)ll./ : group
8. 수량자
   8.1 [eay]{3} : e, a, y 중 택 1이 3개 ({3,} : 3개 이상, {1,3} : 1개 ~ 3개)
   8.2 _* : 앞에 있는 문자가 0개 ~ N개, 예를 들어 [eay]*면 e, a, y 중 택 1이 0개~ N개
   8.3 _+ : 앞에 있는 문자가 1개 ~ N개
   8.4 _? : 앞에 있는 문자가 0개 ~ 1개
9. 캐릭터 클래스
   9.1 /\w/gm : 워드
   9.2 /\w{5} /gm : 5개의 글자와 스페이스 하나
   9.3 /\W/gm : not 워드
   9.4 /\d/gm : 숫자
   9.5 /\D/gm : not 숫자
   9.6 /\s/gm : 스페이스
   9.7 /\S/gm : not 스페이스
10. 이스케이프 문자(역슬러쉬, \) : /\(.*\)/g